tap 'caskroom/cask'
tap 'homebrew/binary'
tap 'homebrew/brewdler'
tap 'peco/peco'
tap 'pivotal/tap'
tap 'sanemat/font'

brew 'emacs'
brew 'git'
brew 'peco'
brew 'rbenv'
brew 'ruby-build'
brew 'tig'
brew 'tmux'
brew 'zsh'
brew 'ricty'

brew 'cmigemo'
brew 'csshx'
brew 'fontconfig'
brew 'fontforge', args: ['with-python']
brew 'ghi'
brew 'gibo'
brew 'gnu-sed'
brew 'gnu-time'
brew 'go'
brew 'heroku-toolbelt'
brew 'htop-osx'
brew 'hub', args: ['HEAD']
brew 'imagemagick'
brew 'jq'
brew 'maven'
brew 'memcached'
brew 'mercurial'
brew 'nkf'
brew 'node'
brew 'open-cobol'
brew 'openssl'
brew 'pcre'
brew 'pkg-config'
brew 'python'
brew 'readline'
brew 'sbt'
brew 'scala'
brew 'ssh-copy-id'
brew 'terraform'
brew 'tree'
brew 'wget'
brew 'xctool'

cask 'alfred'
cask 'appcleaner'
cask 'appcode'
cask 'atom'
cask 'ccmenu'
cask 'coteditor'
cask 'disk-inventory-x'
cask 'dropbox'
cask 'flash'
cask 'github'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'karabiner'
cask 'keyboard-maestro'
cask 'kobito'
cask 'lyn'
cask 'marked'
cask 'minecraft'
cask 'mysqlworkbench'
cask 'osxfuse'
cask 'seil'
cask 'sequel-pro'
cask 'silverlight'
cask 'sourcetree'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
