cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'd12frosted/emacs-plus'
tap 'homebrew/binary'
tap 'pivotal/tap'
tap 'sanemat/font'
tap 'thoughtbot/formulae'

# AppStore apps

mas '1Password',    id: 443987910
mas 'DayOne',       id: 847496013
mas 'Deckset',      id: 847496013
mas 'Divvy',        id: 413857545
mas 'GeekBench 4',  id: 1175706108
mas 'iAWriter',     id: 847496013
mas 'LINE',         id: 539883307
mas 'Md Linker',    id: 1289119450
mas 'Pastebot',     id: 1179623856
mas 'Pocket',       id: 568494494
mas 'Reeder3',      id: 880001334
mas 'Slack',        id: 803453959
mas 'Things 3',	    id: 904280696
mas 'Tweetbot',     id: 557168941

# Apps

cask 'appcleaner'
cask 'atom'
cask 'bartender'
cask 'bitbar'
cask 'contexts'
cask 'dash'
cask 'docker'
cask 'font-fira-code'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'hyper'
cask 'iterm2'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'jetbrains-toolbox'
cask 'kindle'
cask 'licecap'
cask 'opensim'
cask 'paw'
cask 'provisioning'
cask 'qlmarkdown'
cask 'quitter'
cask 'realm-browser'
cask 'rescuetime'
cask 'reveal'
cask 'sketch'
cask 'sketch-toolbox'
cask 'teensy'
cask 'zeplin'

# brew packages

brew 'ack'
brew 'bison'
brew 'binutils'
brew 'carthage'
brew 'csshx'
brew 'cvs'
brew 'emacs', args: ['with-cocoa', 'with-gnutls']
brew 'entr'
brew 'fish'
brew 'fontconfig'
brew 'fontforge', args: ['--with-python']
brew 'fzf'
brew 'ghq'
brew 'gibo'
brew 'git'
brew 'git-plus'
brew 'gnu-sed'
brew 'gnu-time'
brew 'go'
brew 'ghq'
brew 'heroku-toolbelt'
brew 'hub', args: ['HEAD']
brew 'imagemagick'
brew 'jq'
brew 'nkf'
brew 'node'
brew 'openssl'
brew 'pcre'
brew 'pkg-config'
brew 'python'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ricty'
brew 'ruby-build'
brew 'ssh-copy-id'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'w3m'
brew 'wget'
