cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'homebrew/binary'
tap 'homebrew/brewdler'
tap 'peco/peco'
tap 'pivotal/tap'
tap 'thoughtbot/formulae'
tap 'sanemat/font'

# AppStore apps

mas '1Password',  id: 443987910
mas 'DayOne',     id: 847496013
mas 'Deckset',    id: 847496013
mas 'Divvy',      id: 413857545
mas 'iAWriter',   id: 847496013
mas 'LINE',       id: 539883307
mas 'Pocket',     id: 568494494
mas 'PixelMator', id: 407963104
mas 'Reeder3',    id: 880001334
mas 'Skitch',     id: 425955336
mas 'Slack',      id: 803453959
mas 'Tweetbot',   id: 557168941
mas 'そら案内',   id: 599799247

# Apps

cask 'alfred'
cask 'appcleaner'
cask 'appcode'
cask 'atom'
cask 'bartender'
cask 'clipy'
cask 'coteditor'
cask 'dash'
cask 'geekbench'
cask 'gitscout'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'google-photos-backup'
cask 'iterm2'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'kindle'
cask 'licecap'
cask 'marked'
cask 'qlmarkdown'
cask 'quitter'
cask 'rescuetime'
cask 'reveal'
cask 'sketch'
cask 'sketch-toolbox'
cask 'sourcetree'
cask 'zeplin'

# brew packages

brew 'ack'
brew 'bison'
brew 'binutils'
brew 'carthage'
brew 'caskroom/cask/brew-cask'
brew 'cmigemo'
brew 'csshx'
brew 'cvs'
brew 'emacs', args: ['with-cocoa', 'with-gnutls']
brew 'entr'
brew 'fontconfig'
brew 'fontforge', args: ['--with-python']
brew 'ghq'
brew 'gibo'
brew 'git'
brew 'gitsh'
brew 'git-plus'
brew 'gnu-sed'
brew 'gnu-time'
brew 'go'
brew 'heroku-toolbelt'
brew 'htop-osx'
brew 'hub', args: ['HEAD']
brew 'imagemagick'
brew 'jq'
brew 'migemogrep'
brew 'nkf'
brew 'node'
brew 'openssl'
brew 'pcre'
brew 'peco'
brew 'pkg-config'
brew 'python'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ricty'
brew 'ruby-build'
brew 'ssh-copy-id'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'w3m'
brew 'wget'
brew 'xctool'
brew 'zsh'
