tap 'caskroom/cask'
tap 'homebrew/binary'
tap 'homebrew/brewdler'
tap 'peco/peco'
tap 'pivotal/tap'
tap 'sanemat/font'

brew 'emacs'
brew 'git'
brew 'peco'
brew 'rbenv'
brew 'ruby-build'
brew 'tig'
brew 'tmux'
brew 'zsh'
brew 'ricty'

brew 'ack'
brew 'autoconf'
brew 'bdw-gc'
brew 'berkeley-db'
brew 'binutils'
brew 'bison'
brew 'brew-cask'
brew 'cmigemo'
brew 'csshx'

brew 'exiftool'
brew 'faac'
brew 'ffmpeg'
brew 'fontconfig'
brew 'fontforge', args: ['with-python']
brew 'freetype'
brew 'gdbm'
brew 'gettext'
brew 'ghi'
brew 'gibo'

brew 'global'
brew 'gmp'
brew 'gnu-sed'
brew 'gnu-time'
brew 'gnupg'
brew 'go'
brew 'heroku-toolbelt'
brew 'htop-osx'
brew 'hub', args: ['HEAD']
brew 'icu4c'
brew 'imagemagick'
brew 'jpeg'
brew 'jq'
brew 'jsl'
brew 'lame'
brew 'libevent'
brew 'libplist'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libusb'
brew 'libxml2'
brew 'lua'
brew 'maven'
brew 'memcached'
brew 'mercurial'
brew 'nkf'
brew 'node'
brew 'open-cobol'
brew 'openssl'
brew 'pcre'
brew 'pkg-config'
brew 'python'
brew 'readline'
brew 'sbt'
brew 'scala'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'terraform'
brew 'tree'
brew 'usbmuxd'
brew 'w3m'
brew 'wget'
brew 'x264'
brew 'xctool'
brew 'xvid'
brew 'xz'
cask 'adobe-reader'
cask 'alfred'
cask 'appcleaner'
cask 'appcode'
cask 'atom'
cask 'ccmenu'
cask '(!)'
cask 'coteditor'
cask 'cyberduck'
cask 'disk-inventory-x'
cask 'dropbox'
cask 'firefox'
cask 'flash'
cask 'flip4mac'
cask 'flux'
cask 'github'
cask 'google-chrome'
cask 'google-drive'
cask 'hipchat'
cask 'iterm2'
cask 'keyboard-maestro'
cask 'keyremap4macbook'
cask '(!)'
cask 'kobito'
cask 'launchbar'
cask 'lyn'
cask 'marked'
cask 'minecraft'
cask 'mysqlworkbench'
cask 'osxfuse'
cask 'sequel-pro'
cask 'silverlight'
cask 'skype'
cask 'sourcetree'
cask 'sublime-text'
cask 'tunnelblick'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
