tap "d12frosted/emacs-plus"
tap "dart-lang/dart"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "helm/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homeport/tap"
tap "leoafarias/fvm"
tap "robusta-dev/krr"
tap "ynqa/tap"
brew "ack"
brew "act"
brew "shellcheck"
brew "actionlint"
brew "little-cms2"
brew "jpeg-xl"
brew "aom"
brew "autoconf"
brew "automake"
brew "bat"
brew "binutils"
brew "bison"
brew "buf"
brew "cmake"
brew "colordiff"
brew "conftest"
brew "cvs"
brew "dive"
brew "unbound"
brew "gnutls"
brew "ffmpeg"
brew "findutils"
brew "node"
brew "firebase-cli"
brew "fzf"
brew "gcc"
brew "libavif"
brew "gemini-cli"
brew "gh"
brew "ghalint"
brew "ghq"
brew "gibo"
brew "git"
brew "gnu-sed"
brew "gnu-time"
brew "gnupg"
brew "go"
brew "go-jsonnet"
brew "gpgme"
brew "netpbm"
brew "graphviz"
brew "helm"
brew "helm-ls"
brew "helmfile"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "krew"
brew "kube-ps1"
brew "kubectx"
brew "kustomize"
brew "libyaml"
brew "mas"
brew "nkf"
brew "nmap"
brew "pkgconf"
brew "node-build"
brew "nodenv"
brew "pandoc"
brew "pngpaste"
brew "pnpm"
brew "poppler"
brew "protobuf"
brew "pure"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "starship"
brew "stern"
brew "terminal-notifier"
brew "tfenv"
brew "tig"
brew "tmux"
brew "tree"
brew "trufflehog"
brew "wakeonlan"
brew "wget"
brew "yq"
brew "z"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@31"
brew "dart-lang/dart/dart"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/terraform", link: false
brew "hashicorp/tap/terraform-ls"
brew "homeport/tap/dyff"
brew "leoafarias/fvm/fvm"
brew "robusta-dev/krr/krr"
brew "ynqa/tap/jnv"
cask "adobe-creative-cloud", args: { appdir: "/Applications" }
cask "appcleaner"
cask "bartender"
cask "choosy", args: { appdir: "/Applications" }
cask "coteditor"
cask "discord"
cask "dropbox"
cask "gcloud-cli", args: { appdir: "/Applications" }
cask "ghostty"
cask "google-drive"
cask "karabiner-elements"
cask "microsoft-edge"
cask "raycast"
cask "via"
cask "visual-studio-code"
vscode "3w36zj6.textlint"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "bufbuild.vscode-buf"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "grafana.vscode-jsonnet"
vscode "hashicorp.terraform"
vscode "marp-team.marp-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.live-server"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
go "github.com/googlecloudplatform/gcsfuse"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "go.k6.io/xk6/cmd/xk6"
