cask_args appdir: "/Applications"

tap "homebrew/cask"

# AppStore apps
# `mas list` to find id of installed apps

mas "Bear",         id: 1091189122
mas "Buffer", 	    id: 1474298973
mas "CotEditor",    id: 1024640650
mas "DayOne",       id: 1055511498
mas "Magnet",	    id: 441258766
mas "URLLinker",    id: 1289119450
mas "Reeder",       id: 1449412482
mas "Slack",        id: 803453959
mas "Streaks",	    id: 1493327990
mas "Todoist", 	    id: 585829637
mas "Tweetbot",     id: 1384080005

# Apps outside AppStore

# cask "1password"
# cask "1password-cli"
cask "adobe-creative-cloud"
cask "android-studio"
cask "appcleaner"
cask "bartender"
cask "brave-browser"
cask "choosy"
cask "cmd-eikana"
cask "contexts"
cask "discord"
cask "docker"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "karabiner-elements"
cask "quitter"
cask "raycast"
cask "via"
cask "visual-studio-code"

# brew packages

tap "dart-lang/dart"
tap "leoafarias/fvm"

brew "ack"
brew "bluetoothconnector"
brew "bison"
brew "binutils"
brew "conftest"
brew "cvs"
brew "dart-lang/dart/dart"
brew "emacs", args: ["with-gnutls"]
brew "findutils"
brew "fvm"
brew "fzf"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "gnu-sed"
brew "gnu-time"
brew "gpg"
brew "imagemagick"
brew "jq"
brew "mas"
brew "nkf"
brew "nodenv"
brew "node-build"
brew "openssl"
brew "pcre"
brew "pkg-config"
brew "python"
brew "rbenv"
brew "readline"
brew "reattach-to-user-namespace"
brew "ruby-build"
brew "ssh-copy-id", link: true
brew "terraform"
brew "tig"
brew "tmux"
brew "tree"
brew "wget"
brew "yq"
