fisherman/await
fisherman/done
fisherman/fzf
fisherman/get
fisherman/getopts
decors/fish-ghq
fisherman/humanize_duration
fisherman/last_job_id
oh-my-fish/theme-nai
